app/views/games/show.html.erb

INSERT INTO "players" DEFAULT VALUES RETURNING "id"
---
<% @player = Player.new %>
<% @player.save %>

SELECT  "games".* FROM "games"  ORDER BY "games"."id" DESC LIMIT 1
---
<% @prompt = Prompt.working_random_prompt.phrase %>
<% @game = Game.last %>