app/controllers/games_controller.rb

    def show



      @game = Game.find_by_id(session[:game_id])

      (redirect_to(game_path(@game)) and return) if params[:id]!=@game.id.to_s

      @winnerless_rounds = @game.rounds.select {|round| !round.winner_id.present?}
      @round = @winnerless_rounds.min_by(&:game_round)


      @prompt = @round.prompt unless @round == nil

      @player = Player.find_by_id(session[:user_id])
      # Stuff that only needs to happen if there is a round

      if @round
        @prompt = @round.prompt
        # Determining the Judge
        # if @round.game_round == 1
          @judge = @round.judge
        # else
        #   @judge = Round.find_by_id((@round.id) -1).winner
        # end

        # Grabbing the selected gifs
          @selections = @round.selections
---
SELECT  "games".* FROM "games"  ORDER BY "games"."id" DESC LIMIT 1
SELECT "prompts".* FROM "prompts"