app/controllers/sessions_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    session[:username] = params[:username]
    @player=Player.find_or_create_by(username: params[:username])
        session[:user_id] = @player.id
    #existing game
    @game=Game.find(params[:existing_game_number])