app/controllers/sessions_controller.rb

INSERT INTO "players" ("username") VALUES ($1) RETURNING "id"  [["username", "gabriel"]]
SELECT  "players".* FROM "players" WHERE "players"."username" = $1 LIMIT 1  [["username", "gabriel"]]
SELECT "players".* FROM "players" INNER JOIN "player_round_gifs" ON "players"."id" = "player_round_gifs"."player_id" INNER JOIN "rounds" ON "player_round_gifs"."round_id" = "rounds"."id" WHERE "rounds"."game_id" = $1  [["game_id", 1]]
---
  def create
    session[:username] = params[:username]
    @player=Player.find_or_create_by(username: params[:username])
        session[:user_id] = @player.id
    #existing game
    @game=Game.find_or_create_by(id: params[:existing_game_number])
    session[:game_id]=@game.id
    @game.players << @player # shovel all the player into the game that they specify
    @player.starting_hand
    @game.rounds.first.judge = @game.players.first